[
  {
    "pageContent": "Team Playbook\nPlays\nWhy Team Playbook\nWays of Working at Atlassian\nFeature Kick-off Meeting\n\nBefore you dive into development, gather your team for a feature kick-off meeting. What's on the agenda? Walkthroughs, feedback, and alternative ways to solve the problem.\n\nUSE THIS PLAY TO...\n\nBuild confidence in a new feature's value and polish up the spec collaboratively instead of throwing it over the fence.\n\nIf you're struggling with shared understanding, value and metrics, or proof of concept on your Health Monitor, running this play might help.\n\nRead more\nAND I NEED THIS... WHY?\n\nThis is the one – the feature your customer research tells you will differentiate your product and delight your customers. You totally should've shipped this last release, so let's get cracking on it.\n\nWhoa! Hold your horses, cowpoke. Your team have no context. You've probably made assumptions in defining the problem this feature solves. There's no agreement on how to measure the feature's success. And let's face it: in all the excitement, it's possible some design or technical challenges were overlooked.\n\nTime to rustle up your team and step through the details before filling your backlog with user stories. Else, you'll start development with more questions than clarity.\n\nWHO SHOULD BE INVOLVED?\n\nGet the whole team together for this one. \n\nPEOPLE\n\n6 - 9\n\nTIME\n\n60 min\n\nDIFFICULTY\n\nMedium\n\nRunning the play\n\nMake sure your new feature is more than just a concept before holding a kick-off meeting. But don't wait until the design is fully baked, either.\n\nMaterials\n\nWhiteboard\n\nMarkers or pens\n\nSticky notes\n\nRubber chicken\n\nPREP\nBuild the concept\n\nBefore the kick-off meeting, the product owner or designer should build out a low-fidelity user journey map and have a rough idea of what to use for success measures. Share these with the team before the session so they can come prepared.\n\nSchedule your feature kick-off meeting in a space with big walls or whiteboards. Arrive a few minutes early, and use that space to put up the user journey you've mapped out.\n\nSTEP 1\nFeature overview (10 min)\n\nWelcome everyone to the kick-off meeting and start by providing an overview of the feature and the context around it. Describe the problem or opportunity it'll address, and how that ties in with broader goals or initiatives. Introduce your target user persona and the value this feature will provide them, citing research or supporting background information. Then lay out your thoughts on measuring success.\n\nRemember: the idea is to do \"just enough\" spec'ing and scoping before the feature kick-off. There are supposed to be holes and gaps at this stage – the purpose of this meeting is to bring the team together to start filling them.\n\nANTI-PATTERN\n\nSharing too late. If the spec is considered \"done\" then you might have missed the chance to pivot based on feedback from your team.\n\nSTEP 2\nFeedback please (10 min)\n\nBefore jumping into the user journey, pause for feedback from the team. If you're met with silence and shakes of the head, use some of these questions to help get your team talking:\n\nDo we have a shared understanding of what this feature is intended to deliver?\nWhat are your hopes for this feature?\nWhat are your fears about it?\nPRO TIP\n\nBring the feature to life by introducing it from the perspective of the target customer persona.\n\nSTEP 3\nUser journey walkthrough (15 min)\n\nRemember that user journey you developed before the kick-off meeting? Walk through it from start to finish. Call out how the user will discover the feature, how they'll interact with it, and how they'll leave it. As you walk through, talk about how the feature will address the problem space, reduce customer friction, or otherwise add value.\n\nInstead of pausing for feedback during the walk-through, ask everyone to jot their thoughts down on sticky notes. This prevents any single team member from inadvertently hijacking the walk-through and leading you down a rabbit hole.\n\nSTEP 4\nCritiques and alternate solutions (20 min)\n\nGo back to the start of the user journey map. For each stage, have everyone post their sticky notes and discuss the team's feedback. (It's fine for people to jot down new questions or concerns on stickies, too.)\n\nForget about what each team member's usual role is. This is a time for everyone to imagine ways the feature might fail (security vulnerabilities? usability flaws? technical constraints? etc.) and suggest ways to avoid them.\n\nCapture all questions and concerns in writing, along with the product owner's answer or decision.\n\nSTEP 5\nWrap it up (5 min)\n\nWhat other information does the team need in order to be clear on what they're doing and why?\n\nAssign any unanswered questions about the feature to a team member, with a due date for coming back with the answer. Typically, answering them involves additional user research, fleshing out edge cases that surfaced during the meeting, or thinking though pieces of the technical design.\n\nPRO TIP\n\nAdd the feature kick-off meeting to your team's standard rituals, so there's a regular feedback loop for features before they hit the team's backlog.\n\nNailed it?\n\nBe sure to run a full Health Monitor session or checkpoint with your team to see if you're improving.\n\nFind your Health Monitor\nVariations\nCROSS GEO TEAM\n\nThis play can be tailored for teams in multiple locations, share the concept early on a Confluence page and make sure the room you book is set-up with a VC.\n\nFollow-ups\n\nIf anyone in the team thinks of new questions after the kick-off meeting, add them to the spec with what they think the answer probably is.\n\nAssign the question to the appropriate team member – if they like the proposed answer, they can just indicate their agreement with it.\n\nRELATED PLAYS\n\nEnd-to-end Demo\n\nSparring\n\nDemo Trust\n\nWant even more Playbook?\n\nDrop your email below to be notified when we add new Health Monitors and plays.\n\nGot feedback?\n\nDrop a question or comment on the Atlassian Community site.\n\nJoin the conversation",
    "metadata": {
      "source": "https://www.atlassian.com/team-playbook/plays/feature-kick-off"
    }
  }
]